app/controllers/results_controller.rb

  def index

    @start_date = (params[:start_date] && Date.parse(params[:start_date])) || Date.today
    @results = User.find(session[:user_id]).results
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT `results`.* FROM `results` INNER JOIN `user_virtues` ON `results`.user_virtue_id = `user_virtues`.id WHERE ((`user_virtues`.user_id = 2))

  def create
    @result = Result.create! params[:result]
---
INSERT INTO `results` (`user_virtue_id`, `date`, `success`, `created_at`, `updated_at`) VALUES(63, NULL, 1, '2011-12-19 06:16:41', '2011-12-19 06:16:41')