app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `name`, `password`, `created_at`, `updated_at`, `salt`) VALUES('jen@jen2.com', NULL, '650db39f085544fdc50a8835338dd85c5bf79a3d', '2012-01-22 08:28:01', '2012-01-22 08:28:01', '9b51814a4dc48ea37bb16d1aa8cadc4bc574d82f')
---
  def create
    salt = Digest::SHA1.hexdigest(Time.now.to_s)
    @user = User.create! :name => params[:user][:name], :email => params[:user][:email], :password => User.encrypted_password(params[:user][:password], salt), :salt => salt