app/controllers/user_virtues_controller.rb

SELECT * FROM `user_virtues` WHERE (`user_virtues`.user_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @user_virtues = User.find(session[:user_id]).user_virtues

INSERT INTO `user_virtues` (`user_id`, `name`, `description`, `ordinal`) VALUES(1, 'jen\'s virtue', 'it\'s a virtue', NULL)
---
  def create
    @user_virtue = UserVirtue.new(params[:user_virtue])
    @user_virtue.user_id = session[:user_id]
    @user_virtue.save!

SELECT * FROM `user_virtues` WHERE (`user_virtues`.`id` = 18)
DELETE FROM `user_virtues` WHERE `id` = 18
---
  def destroy
    @user_virtue = UserVirtue.find(params[:id])
    @user_virtue.destroy

SELECT * FROM `virtues`
INSERT INTO `user_virtues` (`user_id`, `name`, `description`, `ordinal`) VALUES(1, 'success', 'success is the best virtue of all', NULL)
---
  def add_standard_virtues
    @standard_virtues = Virtue.all
    @standard_virtues.each do |virtue|
      new_virtue = UserVirtue.create! :name => virtue.name,
        :description => virtue.description,
        :user_id => session[:user_id]

SELECT * FROM `user_virtues` WHERE (`user_virtues`.user_id = 1)
SELECT * FROM `virtues`
INSERT INTO `user_virtues` (`user_id`, `name`, `description`, `ordinal`) VALUES(1, 'Moderation', 'Avoid extreams; forbear resenting injuries so much as you think they deserve.', NULL)
---
  def add_selected_virtues
    existing_virtues = current_user.user_virtues
    Virtue.all.each do |virtue|
      if params[virtue.name] == "1" && !existing_virtues.detect{|v| v.name == virtue.name}
        UserVirtue.create! :user_id => session[:user_id], :name => virtue.name, :description => virtue.description