app/controllers/virtues_controller.rb

SELECT * FROM `virtues`
---
  def index
    @virtues = Virtue.all