app/controllers/virtue_controller.rb

  def index
    @virtues = Virtue.all
---
SELECT * FROM `virtues`